day_1/app/controllers/questions_controller.rb

  def index
    @questions = Question.order(id: :desc)
---
SELECT "questions".* FROM "questions"  ORDER BY "questions"."id" DESC

  def show
    @question = Question.find_by(id: params[:id])
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT 1  [["id", 49]]